export const ANATOMY: Record<string, string[]> = {
  'Спина и шея': ['Широчайшие мышцы', 'Верх спины', 'Поясница', 'Передняя поверхность шеи', 'Задняя поверхность шеи'],
  Грудь: ['Грудь'],
  Плечи: ['Передняя дельта', 'Средняя дельта', 'Задняя дельта'],
  Руки: ['Бицепс', 'Трицепс', 'Предплечья'],
  'Пресс и косые': ['Пресс', 'Косые мышцы', 'Подвздошно-поясничная'],
  Ноги: ['Передняя часть бедра', 'Задняя часть бедра', 'Внутренняя часть бедра', 'Наружная часть бедра', 'Голень'],
  Ягодицы: ['Ягодицы'],
};

export const PRIMARY_GROUPS = Object.keys(ANATOMY);
