// frontend/public/js/utils/constants.js

export const ANATOMY = {
    "Грудь": ["Большая грудная", "Малая грудная", "Передняя зубчатая"],
    "Спина": ["Широчайшие", "Трапеции", "Ромбовидные", "Поясница", "Круглая"],
    "Плечи": ["Передняя дельта", "Средняя дельта", "Задняя дельта", "Ротаторная манжета"],
    "Руки": ["Бицепс", "Трицепс", "Брахиалис", "Предплечья"],
    "Ноги": ["Квадрицепс", "Бицепс бедра", "Ягодичные", "Икроножные", "Камбаловидная", "Приводящие", "Отводящие"],
    "Пресс и Кор": ["Прямая мышца (Кубики)", "Косые мышцы", "Поперечная мышца"],
    "Кардио": ["Сердечно-сосудистая", "Всё тело (Берпи/Кроссфит)"]
};

export const PRIMARY_GROUPS = Object.keys(ANATOMY);